## [terraform-github](http://peterdeme.app.spacelift.tf/stack/terraform-github/run/01G6WD3CX3QK6XZVE58KX7RCZ1) plan logs

```
[01G6WCKV3TTEZRTZ3B0J8B5AZ2] Planning changes with 0 custom hooks...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.testparam will be created
  + resource "aws_ssm_parameter" "testparam" {
      + arn       = (known after apply)
      + data_type = (known after apply)
      + id        = (known after apply)
      + key_id    = (known after apply)
      + name      = "peterdeme-test-parameter"
      + tags      = {
          + "developer" = "peterdeme"
          + "env_name"  = "development"
        }
      + tags_all  = {
          + "developer" = "peterdeme"
          + "env_name"  = "development"
        }
      + tier      = "Standard"
      + type      = "String"
      + value     = (sensitive value)
      + version   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: spacelift.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "spacelift.plan"
[01G6WCKV3TTEZRTZ3B0J8B5AZ2] Changes are GO
[01G6WCKV3TTEZRTZ3B0J8B5AZ2] Uploading the list of managed resources...
[01G6WCKV3TTEZRTZ3B0J8B5AZ2] Please be aware that Run changes calculation includes Terraform output changes.
[01G6WCKV3TTEZRTZ3B0J8B5AZ2] Resource list upload is GO
[01G6WCKV3TTEZRTZ3B0J8B5AZ2] Generating JSON representation of the plan...
[01G6WCKV3TTEZRTZ3B0J8B5AZ2] JSON representation is GO
[01G6WCKV3TTEZRTZ3B0J8B5AZ2] No plan policies to evaluate
```